[{
  "_id": {
    "$oid": "66b7b07857426b26404ebd67"
  },
  "title": "10 ejercicios de ficheros Java SE para practicar",
  "content": "<p>Hola a todos, hoy os voy a dejar 10 ejercicios de ficheros Java para practicar.</p><p>Todos estos ejercicios puedes encontrarlos en mi github: <a href=\"https://github.com/DiscoDurodeRoer/curso-java-se/tree/master/ejercicios/03-ficheros</a>\" target=\"_blank\">https://github.com/DiscoDurodeRoer/curso-java-se/tree/master/ejercicios/03-ficheros</a></p><p>Curso completo Java: <a href=\"https://github.com/DiscoDurodeRoer/curso-java-se</a>\" target=\"_blank\">https://github.com/DiscoDurodeRoer/curso-java-se</a></p><p>Crea un directorio llamado pruebas.</p><ol start=\"NaN\"><li><p>Crea 10 ficheros dentro del directorio pruebas con el siguiente formato: file-.txt donde se sustituirá por el numero del fichero. Lista los fichero dentro de la carpeta pruebas.</p></li><li><p>Escribe en el fichero numeros.txt los numeros del 1 al número introducido.</p></li><li><p>Escribe un fichero de 20 lineas donde cada linea sera un password aleatorio.</p></li><li><p>Usa un Scanner para pedir lineas de texto al usuario y guardalas con un PrintWriter.</p></li><li><p>Pide una ruta de origen de un fichero. Debe cumplir los siguientes requisitos:</p><ol><li><p>Debe existir</p></li><li><p>Debe ser un fichero</p></li><li><p>Debe tener alguna de las siguientes extensiones:</p><ol><li><p>jpg</p></li><li><p>png</p></li><li><p>mp3</p></li><li><p>mp4</p></li></ol></li></ol></li><li><p>Vamos a gestionar una serie de personas. Cada registro tiene el siguiente formato:</p><ol><li><p>Nombre: String de 10 caracteres</p></li><li><p>Edad: int</p></li><li><p>Altura: float</p></li><li><p>Peso: float</p></li></ol></li><li><p>Vamos a gestionar una serie de productos. Cada registro tiene el siguiente formato:</p><ol><li><p>ID: int, este sera autoincrementado</p></li><li><p>Nombre: String de 20 caracteres</p></li><li><p>Precio: float</p></li><li><p>Descuento: boolean</p></li></ol></li><li><p>Crea un menu con las siguientes opciones:</p><ol><li><p>Crear producto: Creamos un producto al final del fichero</p></li><li><p>Buscar producto: Pedimos un id y mostramos los datos de ese producto</p></li><li><p>Mostrar productos: Mostramos todos los productos</p></li><li><p>Salir: Salimos de la aplicación</p></li></ol></li><li><p>Vamos a gestionar una serie de productos serializados. Crea la clase Producto con los siguientes atributos:</p><ol start=\"NaN\"><li><p>id (int)</p></li><li><p>nombre (String)</p></li><li><p>precio (float)</p></li></ol></li><li><p>Vamos a gestionar una serie de productos serializados. Crea la clase Producto con los siguientes atributos:</p><ol start=\"NaN\"><li><p>id (int)</p></li><li><p>nombre (String)</p></li><li><p>precio (float)</p></li></ol></li></ol><p>Te lo dejo en video:</p><p><a href=\"https://youtu.be/n9S89CgFHig\" target=\"_blank\">https://youtu.be/n9S89CgFHig</a></p><p>¿Lo necesitas con teoría incluida?</p><p><a href=\"https://youtu.be/Bcij5osidEs\" target=\"_blank\">https://youtu.be/Bcij5osidEs</a></p><p>Espero que os sea de ayuda. Si tenéis dudas, preguntad. Estamos para ayudarte.</p>",
  "publishedDate": {
    "$date": "2024-08-10T18:25:00.000Z"
  },
  "categories": [
    "668f07ba86f12d4e30f3b170"
  ],
  "__v": 0,
  "img": "./images/posts/66b7b07857426b26404ebd67.jpeg"
},
{
  "_id": {
    "$oid": "66b7b15b57426b26404ebd87"
  },
  "title": "Java - Como saber si un numero es potencia de dos",
  "content": "<p>Hola a todos, hoy os voy a explicar como podemos saber si un numero es potencia de 2 en Java.</p><p>Es posible que necesitemos saber en algún momento para nuestras aplicaciones si un número es potencia de 2.</p><p>Tenemos varias formas de hacerlo:</p><h2>Indicar si es potencia de dos en Java: forma 1</h2><p>La forma sin complicaciones pero algo menos optima, seria ir dividiendo entre 2 e ir comprobando si el numero es divisible entre 2:</p><h2>Indicar si es potencia de dos en Java: forma 2</h2><p>La segunda forma, es usando logaritmos, si dividimos el logaritmo del numero entre el logaritmo de 2, si es potencia de 2, debe devolver un numero entero sin decimales.</p><p>Es útil pero cuando son números altos puede volverse impreciso.</p><h2>Indicar si es potencia de dos: forma 3</h2><p>La ultima forma es usando operadores de bit para indicar si es potencia de 2.</p><p>Cuando realizamos la operación <strong>numero &amp; (numero - 1)</strong>, lo que estamos haciendo es realizar una operación AND bit a bit entre numero y el número que resulta de restarle 1 a numero.</p><p>Por lo tanto, cuando realizamos la operación AND bit a bit entre numero y (numero - 1), el resultado será 0 si y solo si numero es una potencia de dos.</p><p>Espero que os sea de ayuda. Si tenéis dudas, preguntad. Estamos para ayudarte.</p>",
  "publishedDate": {
    "$date": "2024-08-07T18:28:00.000Z"
  },
  "categories": [
    "66b7c8993243ad76ff26d3f4",
    "66b7a64c57426b26404ebb64"
  ],
  "__v": 0,
  "img": "./images/posts/66b7b15b57426b26404ebd87.jpeg"
},
{
  "_id": {
    "$oid": "66b7b4a957426b26404ebdb2"
  },
  "title": "Crea tu propia biblioteca de componentes en Angular",
  "content": "<p>Hola a todos, hoy os voy a explicar como podemos crear nuestra propia biblioteca de componentes usando Angular.</p><p>Una biblioteca de componentes es un conjunto de componentes, pipes, servicios, directivas que podemos reutilizar y compartir con el resto.</p><p>Es muy útil para la creación de productos, ya que puedes crear una estructura básica y reutilizar todo lo ya hecho.</p><p>En este proyecto podemos hacer incluso documentación para ayudar al resto a entender que hemos hecho.</p><h2>Creación proyecto biblioteca</h2><p>Abrimos una terminal y escribimos lo siguiente:</p><p><strong>ng generate library ddr-test-library --prefix=ddr-test</strong></p><p>Cambia <strong>ddr-test-library</strong> por el nombre que prefieras.</p><p>En el prefijo, ponle el que tu prefieras, es el prefijo que tendrán tus componentes.</p><p>De inicio, tendremos un componente creado por defecto.</p><p>En este caso, voy a cambiar el selector de este componente de la biblioteca.</p><h2>Arrancar biblioteca Angular</h2><p>Para testear y probar nuestra biblioteca, vamos a añadir el siguiente script en el fichero <strong>package.json</strong> (no el que esta en projects).</p><p><strong>\"start-library\": \"npm link ./projects/ddr-test-library/ &amp;amp;&amp;amp; ng serve --watch\"</strong></p><p><strong>npm link</strong> enlaza nuestra biblioteca para detectar cambios, es importante importar los elementos de la biblioteca en <strong>app.module</strong></p><p>Para ejecutar ese comando, escribimos en la terminal:</p><p><strong>npm run start-library</strong></p><p>Te dejo un video explicando el tema.</p><p><a href=\"https://www.youtube.com/watch?v=1NLYhcZuDGo\" target=\"_blank\">https://www.youtube.com/watch?v=1NLYhcZuDGo</a></p><p>Espero que os sea de ayuda. Si tenéis dudas, preguntad. Estamos para ayudarte.</p>",
  "publishedDate": {
    "$date": "2024-08-09T18:36:00.000Z"
  },
  "categories": [
    "66b7a64c57426b26404ebb64"
  ],
  "__v": 0,
  "img": "./images/posts/66b7b4a957426b26404ebdb2.jpeg"
},
{
  "_id": {
    "$oid": "66b8da87e605f4aec76edf00"
  },
  "title": "Integrar wavesurfer.js en tu proyecto Angular",
  "content": "<p>Hola a todos, hoy os voy a explicar como podemos integrar wavesurfer.js en tu proyecto de Angular.</p><p>Wavesurfer.js es un proyecto de código abierto para la la visualización de audio en forma de ondas (waveform), pudiendo personalizar estilos y eventos.</p><h2>Documentación oficial de wavesurfer.js</h2><p>Antes de empezar, te recomiendo que te des una vuelta por la <a href=\"https://wavesurfer-js.org/\" title=\"https://wavesurfer-js.org/\" target=\"_blank\">documentación oficial</a> que es bastante buena.</p><h2>Creación proyecto Angular</h2><p>Lo primero es crear un proyecto Angular, sino sabes como se hace, te dejo un <a href=\"https://www.discoduroderoer.es/crear-y-ejecutar-un-proyecto-angular/\" title=\"https://www.discoduroderoer.es/crear-y-ejecutar-un-proyecto-angular/\" target=\"_blank\">tutorial</a> aquí</p><h2>Instalación de wavesurfer.js</h2><p>Para empezar, abre una terminal y escribe:</p><p><strong>npm install --save wavesurfer.js</strong></p><h2>Creación de waveform</h2><p>Antes de crear nuestro waveform, vamos a crear un componente en angular.</p><p><strong>ng g c wavesurfer</strong></p><p>En la parte HTML, pondremos un contendor para almacenar el waveform.</p><p>Y en la parte TS, debemos referenciar ese contenedor con ViewChild, necesitaremos implementar AfterViewInit para que se cargue correctamente.</p><p>Ahora, nos toca crearnos un objeto usando Wavesurfer.</p><p>Los campos más importantes son container y url (ruta de un audio). El audio puedes coger el del ejemplo de más abajo u otro cualquiera. Podemos personalizar como queramos nuestro waveform.</p><h2>Eventos en wavesurfer.js</h2><p>Los eventos son necesarios para monitorizar las acciones que van ocurriendo en nuestro audio, por ejemplo, cuando se reproduce, cuando se para, cuando interactuamos con el elemento, etc. Con el objeto waveform que hemos creado antes, tenemos dos métodos para monitorizar eventos, en ambos les pasamos el evento y un callback (función):</p><ul><li><p><strong>on</strong>: ejecuta el callback pasado cada vez que el evento se lanza.</p></li><li><p><strong>once</strong>: ejecuta el callback pasado solo la primera vez.</p></li></ul><p>Os dejo el repositorio de <a href=\"https://github.com/DiscoDurodeRoer/example-wavesurferjs-angular\" title=\"https://github.com/DiscoDurodeRoer/example-wavesurferjs-angular\" target=\"_blank\">Github</a> con todo el código que hemos visto.</p><p>También un video donde os explico todo paso a paso.</p><p><a href=\"https://youtu.be/0ZX8f_coEF8\" target=\"_blank\">https://youtu.be/0ZX8f_coEF8</a></p><p>Espero que os sea de ayuda. Si tenéis dudas, preguntad. Estamos para ayudarte.</p>",
  "publishedDate": {
    "$date": "2024-08-09T15:32:00.000Z"
  },
  "categories": [
    "66b7a64c57426b26404ebb64"
  ],
  "__v": 0,
  "img": "./images/posts/66b8da87e605f4aec76edf00.jpeg"
},
{
  "_id": {
    "$oid": "66b8dc85e605f4aec76edf1b"
  },
  "title": "Ejercicios Propuestos Y Resueltos Tienda Oracle",
  "content": "<p>Hola a todos, hoy os dejo ejercicios propuestos y resueltos de la base de datos de tienda en oracle.</p><p>Todos los ejercicios que proponemos están resueltos en este mismo post, intenta hacerlo por ti mismo y si te quedas atascado puedes mirar la solución. Recuerda, que no tiene por que estar igual tu solución con la del post, el objetivo es que aprendas no que me copies la solución.</p><p><a href=\"https://github.com/DiscoDurodeRoer/scripts-bd/blob/master/oracle/tienda.sql\" title=\"https://github.com/DiscoDurodeRoer/scripts-bd/blob/master/oracle/tienda.sql\" target=\"_blank\">Aquí</a>&nbsp;te dejo la base de datos de tienda que debes importar.</p><p>Si no tienes instalado oracle database XE, os dejo algunos manuales:</p><p><a href=\"https://www.discoduroderoer.es/como-instalar-oracle-database-xe-en-windows/\" target=\"_blank\">https://www.discoduroderoer.es/como-instalar-oracle-database-xe-en-windows/</a></p><p><a href=\"https://www.discoduroderoer.es/como-instalar-sql-developer-en-windows/\" target=\"_blank\">https://www.discoduroderoer.es/como-instalar-sql-developer-en-windows/</a></p><p>También puedes usar Oracle Live.</p><p><a href=\"https://www.discoduroderoer.es/como-utilizar-oracle-live/\" target=\"_blank\">https://www.discoduroderoer.es/como-utilizar-oracle-live/</a></p><p>Al final de cada ejercicio, os indico el resultado esperado de la consulta. Si hay muchos datos, indico el numero de filas.</p><p>Os dejo el modelo Entidad - Relación de la base de datos:</p><p>1. Lista el nombre de todos los productos que hay en la tabla producto.</p><p>2. Lista los nombres y los precios de todos los productos de la tabla producto.</p><p>3. Lista todas las columnas de la tabla producto.</p><p>4. Lista el nombre de los productos, el precio en euros y el precio en dólares estadounidenses (USD).</p><p>5. Lista el nombre de los productos, el precio en euros y el precio en dólares estadounidenses (USD). Utiliza los siguientes alias para las columnas: nombre de producto, euros, dólares.</p><p>6. Lista los nombres y los precios de todos los productos de la tabla producto, convirtiendo los nombres a mayúscula.</p><p>7. Lista los nombres y los precios de todos los productos de la tabla producto, convirtiendo los nombres a minúscula.</p><p>8. Lista el nombre de todos los fabricantes en una columna, y en otra columna obtenga en mayúsculas los dos primeros caracteres del nombre del fabricante.</p><p>9. Lista los nombres y los precios de todos los productos de la tabla producto, redondeando el valor del precio.</p><p>10. Lista los nombres y los precios de todos los productos de la tabla producto, truncando el valor del precio para mostrarlo sin ninguna cifra decimal.</p><p>11. Lista el código de los fabricantes que tienen productos en la tabla producto.</p><p>12. Lista el código de los fabricantes que tienen productos en la tabla producto, eliminando los códigos que aparecen repetidos.</p><p>13. Lista los nombres de los fabricantes ordenados de forma ascendente.</p><p>14. Lista los nombres de los fabricantes ordenados de forma descendente.</p><p>15. Lista los nombres de los productos ordenados en primer lugar por el nombre de forma ascendente y en segundo lugar por el precio de forma descendente.</p><p>16. Devuelve una lista con las 5 primeras filas de la tabla fabricante.</p><p>17. Devuelve una lista con 2 filas a partir de la cuarta fila de la tabla fabricante. La cuarta fila también se debe incluir en la respuesta.</p><p>18. Lista el nombre y el precio del producto más barato. (Utilice solamente las cláusulas ORDER BY y ROWNUM).</p><p>19. Lista el nombre y el precio del producto más caro. (Utilice solamente las cláusulas ORDER BY y ROWNUM).</p><p>20. Lista el nombre de todos los productos del fabricante cuyo código de fabricante es igual a 2.</p><p>21. Lista el nombre de los productos que tienen un precio menor o igual a 120€.</p><p>22. Lista el nombre de los productos que tienen un precio mayor o igual a 400€.</p><p>23. Lista el nombre de los productos que no tienen un precio mayor o igual a 400€.</p><p>24. Lista todos los productos que tengan un precio entre 80€ y 300€. Sin utilizar el operador BETWEEN.</p><p>25. Lista todos los productos que tengan un precio entre 60€ y 200€. Utilizando el operador BETWEEN.</p><p>26. Lista todos los productos que tengan un precio mayor que 200€ y que el código de fabricante sea igual a 6.</p><p>27. Lista todos los productos donde el código de fabricante sea 1, 3 o 5. Sin utilizar el operador IN.</p><p>28. Lista todos los productos donde el código de fabricante sea 1, 3 o 5. Utilizando el operador IN.</p><p>29. Lista el nombre y el precio de los productos en céntimos (Habrá que multiplicar por 100 el valor del precio). Cree un alias para la columna que contiene el precio que se llame céntimos.</p><p>30. Lista los nombres de los fabricantes cuyo nombre empiece por la letra S.</p><p>31. Lista los nombres de los fabricantes cuyo nombre termine por la vocal e.</p><p>32. Lista los nombres de los fabricantes cuyo nombre contenga el carácter w.</p><p>33. Lista los nombres de los fabricantes cuyo nombre sea de 4 caracteres.</p><p>34. Devuelve una lista con el nombre de todos los productos que contienen la cadena Portátil en el nombre.</p><p>35. Devuelve una lista con el nombre de todos los productos que contienen la cadena Monitor en el nombre y tienen un precio inferior a 215 €.</p><p>36. Lista el nombre y el precio de todos los productos que tengan un precio mayor o igual a 180€. Ordene el resultado en primer lugar por el precio (en orden descendente) y en segundo lugar por el nombre (en orden ascendente).</p><p>37. Devuelve una lista con el nombre del producto, precio y nombre de fabricante de todos los productos de la base de datos.</p><p>38. Devuelve una lista con el nombre del producto, precio y nombre de fabricante de todos los productos de la base de datos. Ordene el resultado por el nombre del fabricante, por orden alfabético.</p><p>39. Devuelve una lista con el código del producto, nombre del producto, código del fabricante y nombre del fabricante, de todos los productos de la base de datos.</p><p>40. Devuelve el nombre del producto, su precio y el nombre de su fabricante, del producto más barato.</p><p>41. Devuelve el nombre del producto, su precio y el nombre de su fabricante, del producto más caro.</p><p>42. Devuelve una lista de todos los productos del fabricante Lenovo.</p><p>43. Devuelve una lista de todos los productos del fabricante Crucial que tengan un precio mayor que 200€.</p><p>44. Devuelve un listado con todos los productos de los fabricantes Asus, Hewlett-Packardy Seagate. Sin utilizar el operador IN.</p><p>45. Devuelve un listado con todos los productos de los fabricantes Asus, Hewlett-Packardy Seagate. Utilizando el operador IN.</p><p>Espero que os sea de ayuda. Si tenéis dudas, preguntad. Estamos para ayudarte.</p>",
  "publishedDate": {
    "$date": "2024-08-10T15:41:00.000Z"
  },
  "categories": [
    "66b8cee095f95106b380c4d3",
    "668f07ba86f12d4e30f3b170"
  ],
  "__v": 0,
  "img": "./images/posts/66b8dc85e605f4aec76edf1b.jpeg"
},
{
  "_id": {
    "$oid": "66b8de0de605f4aec76edf4c"
  },
  "title": "Ejercicios propuestos y resueltos PL SQL (Jardineria)",
  "content": "<p>Hola a todos, hoy os dejo una serie de ejercicios sobre la base de datos oracle.</p><p>Todos los ejercicios que proponemos están resueltos en este mismo post, intenta hacerlo por ti mismo y si te quedas atascado puedes mirar la solución. Recuerda, que no tiene por que estar igual tu solución con la del post, el objetivo es que aprendas no que me copies la solución.</p><p>Aquí te dejo la base de datos de jardinería que debes importar</p><p>Os dejo el modelo Entidad - Relación de la base de datos:</p><p>1. Mostrar 'Hola mundo' por pantalla.</p><p>2. Declarar una variable numerica y mostrar si es mayor de 10 o no.</p><p>3. Declarar una variable numerica y pedir su valor y mostrarlo.</p><p>4. Mostrar los numeros del 1 al 100 con un while.</p><p>5. Mostrar los numeros del 1 al 100 con un for.</p><p>6. Mostrar los numeros del 1 al 100 con un loop.</p><p>7. Mostrar el nombre de un cliente dado su codigo.</p><p>8. Mostrar el precioVenta y la gama de un producto dado su codigo.</p><p>9. Mostrar toda la informacion de un pedido dado su codigo (fechaEsperada, fechaEntrega, fechapedido, estado, comentarios)</p><p>10. Realizar una función que me devuelva la suma de pagos que ha realizado. Pasa el codigo por parametro.</p><p><a href=\"https://youtube.com/playlist?list=PLaxZkGlLWHGXKW7v6qaxj7Zsdh7bf_CmV\" target=\"_blank\">https://youtube.com/playlist?list=PLaxZkGlLWHGXKW7v6qaxj7Zsdh7bf_CmV</a></p><p>Espero que os sea de ayuda. Si tenéis dudas, preguntad. Estamos para ayudarte.</p>",
  "publishedDate": {
    "$date": "2024-08-09T15:51:00.000Z"
  },
  "categories": [
    "66b8cee095f95106b380c4d3",
    "66b7a64c57426b26404ebb64"
  ],
  "__v": 0,
  "img": "./images/posts/66b8de0de605f4aec76edf4c.jpeg"
}]